mock-api/artillery/03-stress-test.yml
config:
  target: 'http://localhost:3001'

  phases:
    - duration: 20
      arrivalRate: 10
      name: 'Start - 10 req/s'

    - duration: 40
      arrivalRate: 20
      rampTo: 100
      name: 'Aggressive ramp - 20 to 100 req/s'

    - duration: 60
      arrivalRate: 150
      name: 'Maximum stress - 150 req/s'

    - duration: 30
      arrivalRate: 200
      name: 'Overload - 200 req/s'

  processor: './processor.cjs'

  http:
    timeout: 10

scenarios:
  - name: 'Complete stress scenario'
    weight: 60
    flow:
      - parallel:
          - get:
              url: '/api/users'

          - get:
              url: '/api/users/{{ $randomNumber(1, 50) }}'

          - post:
              url: '/api/users'
              json:
                name: 'Stress User {{ $randomString() }}'
                email: 'stress{{ $randomNumber(1, 100000) }}@example.com'

      - get:
          url: '/api/users?page={{ $randomNumber(1, 10) }}&limit=20'

  - name: 'Slow endpoints test'
    weight: 20
    flow:
      - get:
          url: '/api/slow?delay={{ $randomNumber(100, 1000) }}'

      - get:
          url: '/api/users'

  - name: 'Error resilience test'
    weight: 20
    flow:
      - get:
          url: '/api/error'

      - get:
          url: '/api/users/999999'

      - post:
          url: '/api/users'
          json:
            name: ''
            email: ''